src/toir_cf/src/Catalogs/торо_ПредопределенныеСценарииРаботыСистемы/торо_ПредопределенныеСценарииРаботыСистемы.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>торо_ПредопределенныеСценарииРаботыСистемы</name>
  <predefined>
    <items>
      <name>ПаспортизацияОборудования</name>
      <description>Паспортизация оборудования</description>
    </items>
    <items>
      <name>ПолныйФункционал</name>
      <description>Полный функционал</description>
    </items>
  </predefined>
  <attributes>
    <name>торо_ИспользоватьСогласование</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>торо_ИспользоватьУведомленияОСобытияхСистемы</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>торо_УчетЗапчастей</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>торо_ИспользоватьТиповыеОР</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>торо_ИспользоватьКартинкиТиповыхОбъектов</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>торо_ИспользоватьСложныеТехКартыРемонтов</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>торо_ИспользоватьНаправленияОР</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>торо_ИспользоватьГарантии</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>торо_ИспользоватьДокументыПринятияИСписанияОборудования</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>торо_ИспользоватьФункциональныеМеста</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>торо_УчетКонтролируемыхПоказателей</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>торо_УчетНаработкиОборудования</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>торо_УчетСостоянияОборудования</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>торо_УчетПусковОборудования</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>торо_УчетВыявленныхДефектовОборудования</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>торо_ИспользоватьППР</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>торо_УчетЗамещающихРемонтов</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>торо_ИспользоватьКоэффициентыРемонтныхОсобенностей</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>торо_ИспользоватьРегламентныеМероприятия</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>торо_ИспользоватьПланированиеПоЖесткимРемЦиклам</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>торо_ИспользоватьЛимитыРемонтов</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>торо_ИспользоватьОценкиРМ</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>торо_РассчитыватьПлановуюСтоимостьРемонтовПриПланировании</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>торо_ИспользоватьЛоты</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>торо_ИспользоватьСметыРемонта</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>торо_ИспользоватьРемонтыПоСостоянию</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>торо_ИспользоватьОбщийПланРабот</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>торо_ИспользоватьВнешниеОснованияДляРабот</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>торо_ИспользоватьНарядыНаВыполнениеРабот</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>торо_ИспользоватьВозможностьОтменыРемонтов</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>торо_ИспользоватьУсложненнуюСхемуЗакрытияНарядов</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>торо_ИспользоватьАналогиНоменклатурыДляРемонтов</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>торо_ИспользоватьУправлениеПерсоналом</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Описание</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>торо_ИспользоватьСтатусыДокументовТОиР</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>торо_ИспользоватьКонтрольОтрицательныхОстатков</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>торо_ВыделятьИнвестиционныеРемонты</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>торо_ИспользоватьСтандартныеОповещенияОПревышенииПоказателей</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>торо_ИспользоватьУпрощеннуюФормуДефекта</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>торо_ИспользоватьФоновыйРасчетППР</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>торо_ИспользоватьОстановочныеРемонты</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>торо_ИспользоватьНарядДопускНаРаботыПовышеннойОпасностиОбязательно</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>торо_ИспользоватьОпасноеПроизводство</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>торо_ЗапретитьВводПотребленияБезАкта</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>торо_ЗапретитьПроведениеАктовСИсполнителямиБезКвалификаций</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>торо_ИспользоватьАктПриемкиОборудования</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>торо_ИспользоватьНарядыНаРегламентноеМероприятие</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>торо_ПоказыватьПодсистемуKPI</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>торо_ЗапретитьРемонтГарантийногоОборудованияХозспособом</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>торо_ИспользоватьХарактеристикиНоменклатуры</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИспользоватьСерииНоменклатуры</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>торо_ИспользоватьВыгрузкуЗагрузкуMSProject</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>торо_ИнтеграцияСПромБезопасностью</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>торо_ПоказыватьПодсистемуИнтеграцияАСУТП</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>торо_НапоминатьЗафиксироватьПростой</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>торо_ИспользоватьПриоритетностьПеренесенныхРемонтов</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>торо_ИспользоватьСкользящееПланирование</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>торо_КонтролироватьВремяРаботыСотрудниковВАктах</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>торо_ВводПотребленияНаОснованииПроведенногоАкта</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>торо_ВводОприходованияНаОснованииПроведенногоАкта</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>торо_НазначениеНаРемонтСУчетомРисков</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>торо_НеПересчитыватьППРВФонеПослеОшибки</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>торо_ЗапретитьВводЗаказовНаВнутреннееПотреблениеБезЗаявки</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>торо_ИспользоватьКомиссии</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>торо_РасширенныйРежимМТО</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>торо_ИнтеграцияЗаказовСERP</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>торо_ЗапретитьПроведениеАктовБезВремениРаботыИсполнителей</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>торо_ИспользоватьИнтеграциюСАИСДиспетчер</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>торо_ЗапретитьПересечениеВремениРаботыСотрудниковСОдинаковойКвалификацией</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>торо_ИспользоватьАнализКоренныхПричин</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>торо_АвтоматическиОбновлятьПоставляемуюМодельПоказателейKPI</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИспользоватьСинхронизациюДанных</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>торо_ИспользоватьСинхронизациюСERP</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>торо_ВремяУчетаРецидивностиДефектов</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>торо_ИспользоватьВремяУчетаРецидивностиДефектов</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>торо_РазрешитьВводНесколькихСметПоРемонту</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>торо_ВводЗаказовНаОснованииПроведенногоДокумента</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>торо_УчитыватьСтатистикуПотребления</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>торо_ПериодРасчетаСтатистикиПотребления</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>торо_ИспользоватьНастраиваемыеПредставления</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>торо_РазрешитьПользовательскуюНастройкуПредставлений</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>торо_ИспользоватьУтверждениеЗаказовНаВнутреннееПотребление</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ВводНаОсновании</name>
    <attributes>
      <name>ПараДокументов</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

src/toir_cf/src/Catalogs/торо_ПредопределенныеСценарииРаботыСистемы/Forms/ФормаВыбора/Module.bsl
#Область ОбработчикиСобытийЭлементовТаблицыФормыСписок
&НаКлиенте
Процедура СписокВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	Выбрать(Истина);
КонецПроцедуры
#КонецОбласти

#Область ОбработчикиКомандФормы
&НаКлиенте
Процедура Выбрать(Команда)
	ТекущиеДанные = Элементы.Список.ТекущиеДанные;
	Если НЕ ТекущиеДанные = Неопределено Тогда
		СтруктураВозврата = ПолучитьСтруктуруВозвратаНаСервере(ТекущиеДанные.Ссылка);
		Оповестить("ОБРАБОТКА_ВЫБОРА_СЦЕНАРИЯ", СтруктураВозврата);
		Закрыть();
	КонецЕсли; 
	
КонецПроцедуры
#КонецОбласти

#Область СлужебныеПроцедурыИФункции
&НаСервереБезКонтекста
Функция ПолучитьСтруктуруВозвратаНаСервере(Ссылка)
	
	СтруктураКонстант = Новый Структура;
	МетаданныеСправочника = Метаданные.Справочники.торо_ПредопределенныеСценарииРаботыСистемы;
	
	Для каждого Реквизит из МетаданныеСправочника.Реквизиты Цикл
		Если Реквизит.Имя = "Описание" Тогда
			Продолжить;
		КонецЕсли;
		СтруктураКонстант.Вставить(Реквизит.Имя, Неопределено);
	КонецЦикла;
		
	Структура = Новый Структура();
	Структура.Вставить("Ссылка", Ссылка);
	Структура.Вставить("Предопределенный", Ложь);
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ *
	|ИЗ
	|	Справочник.торо_ПредопределенныеСценарииРаботыСистемы КАК торо_ПредопределенныеСценарииРаботыСистемы
	|ГДЕ
	|	торо_ПредопределенныеСценарииРаботыСистемы.Ссылка = &Ссылка";
	
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		
		ЗаполнитьЗначенияСвойств(СтруктураКонстант, Выборка);

		Структура.Предопределенный = Выборка.Предопределенный;
		Структура.Вставить("МассивСтруктурЗначенийКонстант", СтруктураКонстант);
		
		ТЗВводНаОсновании = Выборка.ВводНаОсновании.Выгрузить();
		
		Если ТЗВводНаОсновании.Количество() > 0 Тогда
			
			Соответствие = Новый Соответствие;
			
			Для каждого Строка Из ТЗВводНаОсновании Цикл
				Соответствие.Вставить(Строка.ПараДокументов,Строка.Значение);
			КонецЦикла;
			
			Структура.Вставить("СоответствиеВводНаОсновании", Соответствие);
			
		КонецЕсли; 
		
	КонецЕсли;
	
	Возврат Структура;

КонецФункции
#КонецОбласти
